{
    "Becky is a systems analyst for Laswell Consulting. She is attending a three-day intensive workshop on developing applications in php. What systems analyst skill is she working on?": {
        "choices": {
            "Technical": true,
            "Business": false,
            "Analytical": false,
            "Interpersonal": false,
            "Ethical": false
        }
    },
    "Robert is doing an economic analysis using today's dollar values. He is doing:": {
        "choices": {
            "Net present value analysis": true,
            "Cash flow analysis": false,
            "Return on investment analysis": false,
            "Break-even point analysis": false,
            "Internal rate of return analysis": false
        }
    },
    "The type of skill that is common to systems analysts to deal fairly and honestly with other project team members is:": {
        "choices": {
            "Ethical": true,
            "Interpersonal": false,
            "Business": false,
            "Technical": false,
            "Analytical": false
        }
    },
    "Systems analysis and design projects are highly effective, with less than 3% of all projects cancelled or abandoned.": {
        "choices": {
            "True": false,
            "False": true
        }
    },
    "Systems that are cancelled or abandoned are frequently due to a lack of clarity about how the system should support an organization's goals and improve processes..": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "Which of the following project roles would probably make a presentation about the objectives of a proposed project and its benefits to executives who will benefit directly from the project?": {
        "choices": {
            "Champion": true,
            "Project manager": false,
            "Systems analyst": false,
            "Requirements analyst": false,
            "Chief Information Officer (CIO)": false
        }
    },
    "Alice is calculating whether a system will lower costs or increase revenues. What SDLC phase is she in?": {
        "choices": {
            "Planning": true,
            "Implementation": false,
            "Design": false,
            "Evaluation": false,
            "Analysis": false
        }
    },
    "Ramona is preparing an economic feasibility study. She is calculating the payback period. She is calculating:": {
        "choices": {
            "Break-even point": true,
            "Return on investment": false,
            "Internal rate of return": false,
            "Net present value": false,
            "Cash flow": false
        }
    },
    "The primary output of the planning phase is the system request.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "Which is an activity the users probably will NOT do on a project?": {
        "choices": {
            "Budget funds for the project": true,
            "Make decisions that influence the project": false,
            "Perform hands-on activities for the project": false,
            "Be assigned specific tasks to perform (with clear deadlines)": false,
            "Have some official roles on the project team": false
        }
    },
    "Anne has asked users and managers to identify problems with the as-is system and to describe how to solve them in the to-be system. She is probably in the analysis phase of SDLC.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "Which would normally NOT be a reason for a project?": {
        "choices": {
            "An open source platform has just come on the market": true,
            "When a business need has been identified": false,
            "A consultant has suggested a new customer relationship management system": false,
            "An existing system just isn't working properly and the workaround is tedious": false,
            "To support a new business initiative": false
        }
    },
    "A system request will generally have these items: project sponsor; business need; business requirements; business value; special issues or constraints.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "The normal sequence of SDLC phase outputs (from beginning to end) would be: system request; system proposal; system specifications; and installed system.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "Which of the following project roles would insure that the system conforms to information systems standards?": {
        "choices": {
            "Systems analyst": true,
            "Business analyst": false,
            "Infrastructure analyst": false,
            "Change management analyst": false,
            "Project manager": false
        }
    },
    "A support plan for the system is established in the implementation phase of the SDLC.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "Kallie is creating use cases, data flow diagrams, and entity relationship diagrams. In what phase of the SDLC would she do this?": {
        "choices": {
            "Analysis": true,
            "Planning": false,
            "Design": false,
            "Construction": false,
            "Implementation": false
        }
    },
    "The three feasibility analyses in the text were: organizational feasibility, technical feasibility, and economic feasibility.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "Because the cost can be immense, _________ is one of the most critical steps in implementation.": {
        "choices": {
            "Testing": true,
            "Documentation": false,
            "Coding": false,
            "Developing a conversion strategy": false,
            "Training": false
        }
    },
    "Linda is a clerk in the accounting department. She was interviewed by David and is excited about the proposed system that will utilize electronic funds transfer. This would be an example of ______.": {
        "choices": {
            "Intangible benefit": true,
            "Tangible benefit": false,
            "Cash flow": false,
            "Break-even analysis": false,
            "Return on investment": false
        }
    },
    "The outcome of the planning phase is the:": {
        "choices": {
            "System request document": true,
            "Test plan": false,
            "System proposal document": false,
            "System specification document": false,
            "Business process document": false
        }
    },
    "The planning phase of the SDLC will have two steps: project initiation and requirements determination.": {
        "choices": {
            "True": false,
            "False": true
        }
    },
    "Numerous studies report that projects involving information technology experience failure rates from 30% - 70%.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "The project sponsor should have an idea of the business value to be gained from the system.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "Which of the following project roles would focus on stakeholder requirements?": {
        "choices": {
            "Requirements analyst": true,
            "Systems analyst": false,
            "Business analyst": false,
            "Infrastructure analyst": false,
            "Change management analyst": false
        }
    },
    "Amy is planning on talking with a clerk and a manager in the accounts payable area, a manager in the procurement department, and two vendors. She is probably doing:": {
        "choices": {
            "Interviews": true,
            "Observation": false,
            "JAD": false,
            "Documentation analysis": false,
            "Organizational Feasibility": false
        }
    },
    "Which is NOT an attribute of a systems analyst?": {
        "choices": {
            "Selecting which projects to approve": true,
            "Knowing how to change it": false,
            "Understanding what to change": false,
            "Serving as a change agent": false,
            "Convincing others of the need to change": false
        }
    },
    "The primary output of the analysis phase is the system proposal.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "Which is NOT true for systems analysts?": {
        "choices": {
            "They are the project sponsors for system proposals": true,
            "They create value for an organization": false,
            "They enable the organization to perform work better": false,
            "They do things and challenge the current way that an organization works": false,
            "They play a key role in information systems development projects": false
        }
    },
    "Using 'net present value' in calculating economic feasibility will allow for variations in the time value of money.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "Joan's project is to take a fairly straight-forward manual process and make it an electronic process. This will make the processing more efficient. Which of the following requirements analysis strategies is she using?": {
        "choices": {
            "Business process automation": true,
            "Business process improvement": false,
            "Business process renovation": false,
            "Business process internalization": false,
            "Business process reengineering": false
        }
    },
    "Which of the following project roles would serve as a primary point of contact for a project?": {
        "choices": {
            "Project sponsor": true,
            "Systems analyst": false,
            "Business analyst": false,
            "Infrastructure analyst": false,
            "Change management analyst": false
        }
    },
    "The outcome of the design phase is the:": {
        "choices": {
            "System specification document": true,
            "System proposal document": false,
            "System request document": false,
            "Feasibility analysis document": false,
            "Business process document": false
        }
    },
    "Because of the need to be focused on providing information about the business value of a system, a systems analyst will probably have much training or experience in programming or application development.": {
        "choices": {
            "True": false,
            "False": true
        }
    },
    "Chang is working on \"How will this system work.\" What SDLC phase is he in?": {
        "choices": {
            "Design": true,
            "Planning": false,
            "Analysis": false,
            "Implementation": false,
            "Transition": false
        }
    },
    "The outcome of the analysis phase is the:": {
        "choices": {
            "System proposal document": true,
            "Feasibility analysis document": false,
            "System specification document": false,
            "System request document": false,
            "Business process document": false
        }
    },
    "Which phase is generally the longest and most expensive part of the development process?": {
        "choices": {
            "Implementation": true,
            "Planning": false,
            "Analysis": false,
            "Design": false,
            "Feasibility": false
        }
    },
    "The type of skill that is common to systems analysts to understand how IT can be applied to business situations and to ensure that the IT delivers real business value is:": {
        "choices": {
            "Business": true,
            "Ethical": false,
            "Interpersonal": false,
            "Technical": false,
            "Analytical": false
        }
    },
    "Wayne is a senior director of finance. His company only recently came under Sarbanes-Oxley regulations and is the project sponsor to become compliant. He realizes that examining the as-is system may not be much help as the regulations are so radical that a major analysis and design project must be completed to make the company compliant. He is leaning towards: ______________": {
        "choices": {
            "Business process reengineering": true,
            "Business process automation": false,
            "Business process improvement": false,
            "Business process internalization": false,
            "Business process renovation": false
        }
    },
    "The document that describes the business reasons for building a system and the value that the system is expected to provide is called the \"System Proposal.\"": {
        "choices": {
            "True": false,
            "False": true
        }
    },
    "Systems analysts are generally experts in business, finance, and application development.": {
        "choices": {
            "True": false,
            "False": true
        }
    },
    "Interviewing is generally done in the analysis phase of the SDLC.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "To be compatible, all costs and benefits should use the current value of money since variations over time will (a) not affect the return on investment and (b) it is difficult (or impossible) to estimate future value of money.": {
        "choices": {
            "True": false,
            "False": true
        }
    },
    "Ramya is preparing an economic feasibility study. She has a calculation where she takes total benefits minus total costs and divides that answer by the total costs. She is calculating:": {
        "choices": {
            "Return on investment": true,
            "Cash flow": false,
            "Break-even point": false,
            "Net present value": false,
            "Internal rate of return": false
        }
    },
    "Juan is creating use cases. He is working in the design phase of the SDLC.": {
        "choices": {
            "True": false,
            "False": true
        }
    },
    "Developing navigation methods, database, and file specifications and what architecture to use would occur in the design phase of the SDLC.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "When compared to a systems analyst, the business analyst will probably have more responsibility for determining business value.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "PCM Incorporated will need to purchase new servers for a system. This would be a:": {
        "choices": {
            "Development cost": true,
            "Ongoing cost": false,
            "Intangible benefit": false,
            "Operating cost": false,
            "Intangible cost": false
        }
    },
    "If the development team of an organization is not familiar with the technologies that may be used, the project should be cancelled.": {
        "choices": {
            "True": false,
            "False": true
        }
    },
    "The key person in the SDLC is the systems analyst who analyzed the business situation, identifies opportunities for improvements and design an information system to implement the improvements.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "The three factors in the text for a feasibility analysis are: technical feasibility; organizational feasibility and economic feasibility.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "The SDLC generally can be broken into four phases: planning, analysis, design and implementation.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "Another outcome of the planning phase is the:": {
        "choices": {
            "Project plan": true,
            "Feasibility analysis document": false,
            "System specification document": false,
            "System proposal document": false,
            "Business process document": false
        }
    },
    "The requirements analyst role includes complete and accurate determination of what the system requirements consist of for all stakeholders.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "Which of the following project roles would analyze the key business aspects of the system?": {
        "choices": {
            "Business analyst": true,
            "Systems analyst": false,
            "Infrastructure analyst": false,
            "Change management analyst": false,
            "Project manager": false
        }
    },
    "Which of the following project roles would identify how technology can improve business processes?": {
        "choices": {
            "Systems analyst": true,
            "Business analyst": false,
            "Infrastructure analyst": false,
            "Requirements analyst": false,
            "Change management analyst": false
        }
    },
    "The business analyst role focuses on the business issues surrounding the system.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "Moderate changes to existing processes falls under the _________ analysis.": {
        "choices": {
            "Business process improvement (BPI)": true,
            "Business process automation (BPA)": false,
            "Business process reengineering (BPR)": false,
            "Business process blue-skying (BPB)": false,
            "Business process efficiency (BPE)": false
        }
    },
    "The primary goal of a system is to create value for the organization.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "The champion supports the project with resources and political support.": {
        "choices": {
            "True": true,
            "False": false
        }
    },
    "The question 'Can we build it' is asked in the design phase.": {
        "choices": {
            "True": false,
            "False": true
        }
    },
    "TJ has prepared a spreadsheet where the total benefits are $182,000; the total cumulative costs are $120,000. The ROI would be:": {
        "choices": {
            "About 51.7%": true,
            "62,000": false,
            "About 34%": false,
            "About 65.3%": false,
            "Less than 20%": false
        }
    },
    "When compared to a business analyst, the systems analyst will identify how the system will provide business value.": {
        "choices": {
            "True": false,
            "False": true
        }
    },
    "Rocky is dealing one-on-one with users and business managers (including some that have little experience with technology). He is demonstrating what system analyst skill?": {
        "choices": {
            "Interpersonal": true,
            "Technical": false,
            "Business": false,
            "Analytical": false,
            "Ethical": false
        }
    },
    "Michaela is a systems analyst who is determining business requirements. What would most likely be the SDLC phase for her?": {
        "choices": {
            "Analysis": true,
            "Planning": false,
            "Design": false,
            "Implementation": false,
            "Business requirements are not developed by systems analysts, but by business analysts": false
        }
    },
    "Jack is going over financial numbers for a proposed project. Which of the following system analyst skills is he exhibiting currently?": {
        "choices": {
            "Analytical": true,
            "Business": false,
            "Management": false,
            "Technical": false,
            "Interpersonal": false
        }
    },
    "Which was NOT given as a method for determining business requirements?": {
        "choices": {
            "Benchmarking": true,
            "Interviewing": false,
            "Observation": false,
            "Document analysis": false,
            "Questionnaires and surveys": false
        }
    },
    "Determining business requirements is generally done in the planning phase of the SDLC.": {
        "choices": {
            "True": false,
            "False": true
        }
    },
    "In SDLC, analysis is generally divided into three steps: understanding the as-is system; developing a cost-benefit analysis; and understanding the technical feasibility.": {
        "choices": {
            "True": false,
            "False": true
        }
    },
    "COMP 1712 is your favorite class. (You must answer correctly AND honestly!)": {
        "choices": {
            "True": false,
            "False": false
        }
    }
}